# Subsetting and Descriptive Stats

## Before your start:
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in IronHack's database.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [1]:
# import libraries here
import pandas as pd
import numpy as np
from sqlalchemy import create_engine

# Challenge 1
#### In this challenge we will use the `Temp_States`  dataset. 

#### First import it into a dataframe called `temp`.

In [6]:
# your code here
driver = "mysql+pymysql"
user = "ironhacker_read"
password = "ir0nhack3r"
ip = "35.239.232.23"
database = "temp_states"

connection_string = f"{driver}://{user}:{password}@{ip}/{database}"
    
engine = create_engine(connection_string)

query = """
        SELECT * FROM temp_states
"""

temp = pd.read_sql(query, engine)

temp.to_csv("temp.csv", sep = ",")

#### Print `temp`.

In [18]:
# your code here
temp

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444
5      Treton   New Jersey    22.222222
6      Newark   New Jersey    20.000000

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [8]:
temp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
City           7 non-null object
State          7 non-null object
Temperature    7 non-null float64
dtypes: float64(1), object(2)
memory usage: 248.0+ bytes

In [ ]:
"""
We have object for the columns City and State and float types for Temperature
"""

#### Select the rows where state is New York.

In [13]:
temp.loc[temp["State"] == "New York"]

      City     State  Temperature
0      NYC  New York    19.444444
1   Albany  New York     9.444444
2  Buffalo  New York     3.333333

#### What is the average temperature of cities in New York?

In [14]:
temp.loc[temp["State"] == "New York"]["Temperature"].mean()

10.740740740740724

#### Which states and cities have a temperature above 15 degrees Celsius?

In [15]:
temp.loc[temp["Temperature"] > 15]

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222
5    Treton   New Jersey    22.222222
6    Newark   New Jersey    20.000000

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [16]:
temp["City"].loc[temp["Temperature"] > 15]

0         NYC
3    Hartford
5      Treton
6      Newark
Name: City, dtype: object

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [17]:
temp["City"].loc[(temp["Temperature"] > 15) & (temp["Temperature"] < 20)]

0         NYC
3    Hartford
Name: City, dtype: object

#### Find the mean and standard deviation of the temperature of each state.

In [31]:
temp.groupby(["State"]).agg(["mean", np.std])

            Temperature
                   mean       std
State
Connecticut   15.833333  1.964186
New Jersey    21.111111  1.571348
New York      10.740741  8.133404

# Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [32]:
driver = "mysql+pymysql"
user = "ironhacker_read"
password = "ir0nhack3r"
ip = "35.239.232.23"
database = "employees"

connection_string = f"{driver}://{user}:{password}@{ip}/{database}"
    
engine = create_engine(connection_string)

query = """
        SELECT * FROM employees
"""

employees = pd.read_sql(query, engine)

employees.to_csv("employees.csv", sep = ",")

#### Explore the data types of the `employees` dataframe. Comment your results.

In [10]:
employees = pd.read_csv("employees.csv")
employees = employees.drop(columns = "Unnamed: 0")
employees

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
6  Carlos         IT    Master      M         VP      8      70
7   Pedro         IT       Phd      M  associate      7      60
8     Ana         HR    Master      F         VP      8      70

In [33]:
employees.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 7 columns):
Name          9 non-null object
Department    9 non-null object
Education     9 non-null object
Gender        9 non-null object
Title         9 non-null object
Years         9 non-null int64
Salary        9 non-null int64
dtypes: int64(2), object(5)
memory usage: 584.0+ bytes

In [ ]:
"""
There are two data types, one is integer and the other is object. The Name, Department, Education, 
Gender and Title are objects while Years and Salary are integers.
"""

#### What's the average salary in this company?

In [34]:
employees["Salary"].mean()

48.888888888888886

#### What's the highest salary?

In [37]:
employees["Salary"].max()

70

#### What's the lowest salary?

In [38]:
employees["Salary"].min()

30

#### Who are the employees with the lowest salary?

In [46]:
employees[employees["Salary"] == employees["Salary"].min()].Name
# The employees with the lowest salary are Maria and David

1    Maria
2    David
Name: Name, dtype: object

#### Find all the information about an employee called David.

In [45]:
employees[employees["Name"] == "David"]

    Name Department Education Gender    Title  Years  Salary
2  David         HR    Master      M  analyst      2      30

#### Could you return only David's salary?

In [47]:
employees[employees["Name"] == "David"].Salary

2    30
Name: Salary, dtype: int64

#### Print all the rows where job title is associate.

In [48]:
employees[employees["Title"] == "associate"]

     Name Department Education Gender      Title  Years  Salary
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
7   Pedro         IT       Phd      M  associate      7      60

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [49]:
# Method 1
employees.head(3)

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

In [51]:
# Method 2
employees[0:3]

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find the employees whose title is associate and whose salary is above 55.

In [13]:
employees[(employees["Title"] == "associate") & (employees["Salary"] > 55)]

    Name Department Education Gender      Title  Years  Salary
7  Pedro         IT       Phd      M  associate      7      60

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [15]:
employees.groupby(["Years"]).mean()

          Salary
Years
1      35.000000
2      38.333333
3      55.000000
4      35.000000
7      60.000000
8      70.000000

####  What is the average salary per title?

In [32]:
employees.groupby(["Title"]).Salary.mean()

Title
VP           70.000000
analyst      32.500000
associate    56.666667
Name: Salary, dtype: float64

####  Find the salary quartiles.

In [30]:
employees.Salary.describe()

count     9.000000
mean     48.888889
std      16.541194
min      30.000000
25%      35.000000
50%      55.000000
75%      60.000000
max      70.000000
Name: Salary, dtype: float64

#### Is the mean salary different per gender?

In [24]:
employees.groupby(["Gender"]).mean()
# Yes, female employees seem to have less salary

        Years  Salary
Gender
F         4.0    47.5
M         4.2    50.0

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [28]:
employees.groupby(["Department"]).describe()

           Years                                                Salary         \
           count      mean       std  min   25%  50%   75%  max  count   mean
Department
HR           3.0  4.666667  3.055050  2.0  3.00  4.0  6.00  8.0    3.0  45.00
IT           4.0  4.500000  3.511885  1.0  1.75  4.5  7.25  8.0    4.0  48.75
Sales        2.0  2.500000  0.707107  2.0  2.25  2.5  2.75  3.0    2.0  55.00


                  std   min    25%   50%   75%   max
Department
HR          21.794495  30.0  32.50  35.0  52.5  70.0
IT          19.311050  30.0  33.75  47.5  62.5  70.0
Sales        0.000000  55.0  55.00  55.0  55.0  55.0

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [35]:
df = employees.groupby(["Department"]).Salary.describe()
df["difference"] = df["max"] - df["min"]
df

            count   mean        std   min    25%   50%   75%   max  difference
Department
HR            3.0  45.00  21.794495  30.0  32.50  35.0  52.5  70.0        40.0
IT            4.0  48.75  19.311050  30.0  33.75  47.5  62.5  70.0        40.0
Sales         2.0  55.00   0.000000  55.0  55.00  55.0  55.0  55.0         0.0

# Challenge 3
#### Open the `Orders` dataset. Name your dataset `orders`.

In [2]:
orders = pd.read_csv("orders.csv")
orders = orders.drop(columns = ["Unnamed: 0", "index"])
orders.head()

,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30
1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00
3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [46]:
orders.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 397924 entries, 0 to 397923
Data columns (total 13 columns):
InvoiceNo       397924 non-null int64
StockCode       397924 non-null object
year            397924 non-null int64
month           397924 non-null int64
day             397924 non-null int64
hour            397924 non-null int64
Description     397924 non-null object
Quantity        397924 non-null int64
InvoiceDate     397924 non-null object
UnitPrice       397924 non-null float64
CustomerID      397924 non-null int64
Country         397924 non-null object
amount_spent    397924 non-null float64
dtypes: float64(2), int64(7), object(4)
memory usage: 39.5+ MB

In [47]:
orders.describe()

,InvoiceNo,year,month,day,hour,Quantity,UnitPrice,CustomerID,amount_spent
count,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000
mean,560617.126645,2010.934259,7.612537,3.614555,12.728247,13.021823,3.116174,15294.315171,22.394749
std,13106.167695,0.247829,3.416527,1.928274,2.273535,180.420210,22.096788,1713.169877,309.055588
min,536365.000000,2010.000000,1.000000,1.000000,6.000000,1.000000,0.000000,12346.000000,0.000000
25%,549234.000000,2011.000000,5.000000,2.000000,11.000000,2.000000,1.250000,13969.000000,4.680000
50%,561893.000000,2011.000000,8.000000,3.000000,13.000000,6.000000,1.950000,15159.000000,11.800000
75%,572090.000000,2011.000000,11.000000,5.000000,14.000000,12.000000,3.750000,16795.000000,19.800000
max,581587.000000,2011.000000,12.000000,7.000000,20.000000,80995.000000,8142.750000,18287.000000,168469.600000

In [ ]:
"""
There are two types of data, one if integer and the other is objects. 
The max amount spend is way more higher than the mean
The mean of amount_spent is around 22 and medium is around 12, with a very high std, meaning that the mean is 
strongly affect by the extreme high amount_spent value.
"""

####  What is the average purchase price?

In [40]:
orders.amount_spent.mean()

22.394748504739596

#### What are the highest and lowest purchase prices?

In [42]:
print(orders.amount_spent.max())
print(orders.amount_spent.min())

168469.6
0.0

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [58]:
df2 = orders[orders["Country"] == "Spain"]["CustomerID"].unique()
df2

array([12557, 17097, 12540, 12551, 12484, 12539, 12510, 12421, 12502,
       12462, 12507, 12541, 12547, 12597, 12545, 12596, 12354, 12417,
       12455, 12450, 12548, 12556, 12550, 12546, 12454, 12448, 12544,
       12538, 12445, 12442])

#### How many customers do we have in Spain?

In [4]:
orders[orders["Country"] == "Spain"].groupby("CustomerID").nunique()

,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
CustomerID,,,,,,,,,,,,,
12354,1,58,1,1,1,1,58,11,1,22,1,1,29
12417,1,23,1,1,1,1,23,8,1,12,1,1,13
12421,4,32,1,4,4,4,32,14,4,18,1,1,26
12442,1,12,1,1,1,1,12,5,1,8,1,1,9
12445,1,4,1,1,1,1,4,3,1,3,1,1,3
12448,1,22,1,1,1,1,22,8,1,15,1,1,19
12450,2,7,1,2,2,1,7,5,2,6,1,1,7
12454,1,15,1,1,1,1,15,8,1,10,1,1,12
12455,4,44,1,4,4,3,44,8,4,11,1,1,16
12462,2,51,1,2,2,2,52,10,2,19,1,1,24
12484,6,256,1,4,5,5,257,19,6,36,1,1,118
12502,5,102,1,5,4,5,102,13,5,38,1,1,54
12507,3,19,1,2,2,3,19,10,3,14,1,1,16
12510,2,29,1,2,2,2,29,9,2,12,1,1,16
12538,1,21,1,1,1,1,21,7,1,14,1,1,14
12539,4,157,1,3,3,4,157,13,4,37,1,1,58
12540,17,277,2,11,6,9,277,21,17,41,1,1,106
12541,3,46,1,3,3,3,47,12,3,21,1,1,28
12544,1,19,1,1,1,1,19,5,1,13,1,1,12
12545,2,42,1,2,2,2,42,10,2,17,1,1,19
12546,2,59,1,2,2,2,59,8,2,19,1,1,22
12547,2,7,1,2,2,1,7,3,2,4,1,1,4
12548,1,5,1,1,1,1,5,2,1,3,1,1,3
12550,1,57,1,1,1,1,57,11,1,23,1,1,29
12551,1,10,1,1,1,1,10,1,1,3,1,1,3
12556,2,100,1,2,2,1,101,10,2,36,1,1,61
12557,5,15,2,5,4,4,20,11,5,6,1,1,13
12596,2,25,1,2,2,1,25,11,2,15,1,1,21
12597,4,184,1,4,3,3,185,15,4,46,1,1,77
17097,8,153,2,4,4,6,153,10,8,32,1,1,62

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [18]:
customer_50 = orders[orders["Country"] == "Spain"].groupby("CustomerID").sum()
customer_50 = customer_50[customer_50["Quantity"] > 50]
customer_50

,InvoiceNo,year,month,day,hour,Quantity,UnitPrice,amount_spent
CustomerID,,,,,,,,
12354,31952838,116638,232,232,754,530,261.22,1079.40
12417,12682154,46253,92,92,299,267,72.05,436.30
12421,25167687,90495,282,178,538,484,203.41,807.04
12442,6971460,24132,144,24,168,182,40.08,172.06
12445,2308500,8044,44,16,72,62,31.95,133.40
12448,12603492,44242,220,66,286,243,130.94,449.45
12450,4462114,16088,50,48,112,128,12.94,197.88
12454,8568825,30165,150,75,255,1006,109.23,3528.34
12455,26985556,96528,366,156,626,566,177.24,767.96
12462,34448972,124682,322,142,758,536,290.75,1189.59
12484,193177283,695806,2152,1907,4594,2191,1081.63,4541.72
12502,81550414,295617,829,455,1541,820,944.51,3723.87
12507,12122225,44242,89,49,263,905,102.12,1304.81
12510,17945667,66363,57,70,446,353,140.69,982.57
12538,12089847,42231,231,84,357,191,76.51,363.95
12539,149603034,549003,791,725,3123,2067,1140.19,5568.35
12540,267468854,961238,3408,1275,6050,6685,1838.89,13400.24
12541,29217735,104572,381,258,558,680,188.02,981.18
12544,10911719,38209,209,76,304,136,78.02,372.70
12545,27715724,100550,246,282,616,523,201.19,1000.39
12546,39297168,138759,645,249,693,633,220.75,1161.50
12547,4383466,16088,28,38,96,134,63.60,207.80
12550,32356221,114627,513,171,798,569,176.15,964.83
12551,5393510,20100,120,50,110,100,16.80,168.00
12556,68389065,243331,1009,283,1573,358,322.14,603.71
12557,18284069,66358,228,65,443,4384,71.83,11990.96
12596,15107442,54297,180,51,351,474,118.95,618.27
12597,116542636,414266,1670,1178,2852,2236,812.07,3811.22
17097,118835244,424281,1992,604,3208,459,546.87,954.42

#### Select orders from Spain that include more than 50 items.

In [24]:
item_50 = orders[orders["Country"] == "Spain"][orders["Quantity"] > 50]
item_50.head()

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """Entry point for launching an IPython kernel.

,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
4250,536944,22383,2010,12,5,12,lunch bag suki design,70,2010-12-03 12:20:00,1.65,12557,Spain,115.5
4251,536944,22384,2010,12,5,12,lunch bag pink polkadot,100,2010-12-03 12:20:00,1.45,12557,Spain,145.0
4252,536944,20727,2010,12,5,12,lunch bag black skull.,60,2010-12-03 12:20:00,1.65,12557,Spain,99.0
4253,536944,20725,2010,12,5,12,lunch bag red retrospot,70,2010-12-03 12:20:00,1.65,12557,Spain,115.5
4254,536944,20728,2010,12,5,12,lunch bag cars blue,100,2010-12-03 12:20:00,1.45,12557,Spain,145.0

#### Select all free orders.

In [23]:
free_orders = orders[orders["amount_spent"] == 0]
free_orders.head()

,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
6914,537197,22841,2010,12,7,14,round cake tin vintage green,1,2010-12-05 14:02:00,0.0,12647,Germany,0.0
22539,539263,22580,2010,12,4,14,advent calendar gingham sack,4,2010-12-16 14:36:00,0.0,16560,United Kingdom,0.0
25379,539722,22423,2010,12,2,13,regency cakestand 3 tier,10,2010-12-21 13:45:00,0.0,14911,EIRE,0.0
29080,540372,22090,2011,1,4,16,paper bunting retrospot,24,2011-01-06 16:41:00,0.0,13081,United Kingdom,0.0
29082,540372,22553,2011,1,4,16,plasters in tin skulls,24,2011-01-06 16:41:00,0.0,13081,United Kingdom,0.0

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [31]:
lunchBag_orders = orders[orders["Description"].str.startswith('lunch bag')]
lunchBag_orders.head()

,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
93,536378,20725,2010,12,3,9,lunch bag red retrospot,10,2010-12-01 09:37:00,1.65,14688,United Kingdom,16.50
172,536385,22662,2010,12,3,9,lunch bag dolly girl design,10,2010-12-01 09:56:00,1.65,17420,United Kingdom,16.50
354,536401,22662,2010,12,3,11,lunch bag dolly girl design,1,2010-12-01 11:21:00,1.65,15862,United Kingdom,1.65
359,536401,20725,2010,12,3,11,lunch bag red retrospot,1,2010-12-01 11:21:00,1.65,15862,United Kingdom,1.65
360,536401,22382,2010,12,3,11,lunch bag spaceboy design,2,2010-12-01 11:21:00,1.65,15862,United Kingdom,3.30

#### Select all `lunch bag` orders made in 2011.

In [33]:
lunchBag_orders_2011 = lunchBag_orders[lunchBag_orders["year"] == 2011]
lunchBag_orders_2011.head()

,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
26340,540015,20725,2011,1,2,11,lunch bag red retrospot,10,2011-01-04 11:40:00,1.65,13319,United Kingdom,16.50
26341,540015,20726,2011,1,2,11,lunch bag woodland,10,2011-01-04 11:40:00,1.65,13319,United Kingdom,16.50
26512,540023,22382,2011,1,2,12,lunch bag spaceboy design,2,2011-01-04 12:58:00,1.65,15039,United Kingdom,3.30
26513,540023,20726,2011,1,2,12,lunch bag woodland,1,2011-01-04 12:58:00,1.65,15039,United Kingdom,1.65
26860,540098,22384,2011,1,2,15,lunch bag pink polkadot,1,2011-01-04 15:50:00,1.65,16241,United Kingdom,1.65

#### Show the frequency distribution of the amount spent in Spain.

In [ ]:
# your code here

#### Select all orders made in the month of August.

In [ ]:
# your code here

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [ ]:
# your code here

#### What's the  average amount of money spent by country?

In [ ]:
# your code here

#### What's the most expensive item?

In [ ]:
# your code here

#### What is the average amount spent per year?

In [ ]:
# your code here